ads/app/controllers/advertisements_controller.rb

INSERT INTO `ads_views` (`ad_id`, `created_at`, `ipaddress`, `hostname`) VALUES(1, '2010-05-06 02:11:26', '127.0.0.1', 'localhost')
---
  def view
    ads = Ad.find(params[:id])
    views = AdsView.new
    views.ad_id = ads.id
    views.ipaddress = request.remote_ip
    views.hostname = request.host
    views.save