ads/app/controllers/emails_controller.rb

SELECT `email_addresses`.id FROM `email_addresses` WHERE (`email_addresses`.`email` = BINARY 'a@yahoo.com') LIMIT 1
INSERT INTO `email_addresses` (`updated_at`, `sent`, `date_sent`, `email`, `created_at`) VALUES('2010-02-03 16:38:36', 0, NULL, 'mike@gmail.com', '2010-02-03 16:38:36')
---
  def create
    begin
      params[:email].split(",").each do |email|
        existing_email = EmailAddress.find_by_email(email) rescue nil
        if existing_email.nil?
          e = EmailAddress.new
          e.email = email
          e.save