ads/app/controllers/logins_controller.rb

SELECT * FROM `users` WHERE (login='mike' and password_hash='e3b0c44298fc1c149afbf4c8996fb92427ae41e4649b934ca495991b7852b855') LIMIT 1
---
  def create
    puts params.inspect
    password = Digest::SHA256.hexdigest("#{params[:password]}")
    puts password
    user = User.find(:first, :conditions => ["login=? and password_hash=?", params[:username], password])